# 第2章: UNIXコマンド

In [2]:
import pandas as pd

df = pd.read_table('./popular-names.txt', header=None, sep='\t', names=['name', 'sex', 'number', 'year'])
print(len(df))

2780

In [3]:
df

           name sex  number  year
0          Mary   F    7065  1880
1          Anna   F    2604  1880
2          Emma   F    2003  1880
3     Elizabeth   F    1939  1880
4        Minnie   F    1746  1880
...         ...  ..     ...   ...
2775   Benjamin   M   13381  2018
2776     Elijah   M   12886  2018
2777      Lucas   M   12585  2018
2778      Mason   M   12435  2018
2779      Logan   M   12352  2018

[2780 rows x 4 columns]

In [7]:
col1 = df['name']
col1.to_csv('./col1.txt', index=False)

col2 = df['sex']
col2.to_csv('./col2.txt', index=False)

In [12]:
pd.concat([col1, col2], axis=1).to_csv('./merge_1_2.txt', index=False)

In [13]:
def output_head(N):
    return df.head(N)

output_head(5)

        name sex  number  year
0       Mary   F    7065  1880
1       Anna   F    2604  1880
2       Emma   F    2003  1880
3  Elizabeth   F    1939  1880
4     Minnie   F    1746  1880

In [14]:
def output_tail(N):
    return df.tail(N)

output_tail(5)

          name sex  number  year
2775  Benjamin   M   13381  2018
2776    Elijah   M   12886  2018
2777     Lucas   M   12585  2018
2778     Mason   M   12435  2018
2779     Logan   M   12352  2018

In [15]:
def split_file(N):
    tmp = df.reset_index(drop=False)
    df_cut = pd.qcut(tmp.index, N, labels=[i for i in range(N)])
    df_cut = pd.concat([df, pd.Series(df_cut, name='sp')], axis=1)
    return df_cut

df_cut = split_file(10)
df_cut['sp'].value_counts()

0    278
1    278
2    278
3    278
4    278
5    278
6    278
7    278
8    278
9    278
Name: sp, dtype: int64

In [17]:
len(df.drop_duplicates(subset='name'))

136

In [5]:
df.sort_values('number', ascending=False)

         name sex  number  year
1340    Linda   F   99689  1947
1360    Linda   F   96211  1948
1350    James   M   94757  1947
1550  Michael   M   92704  1957
1351   Robert   M   91640  1947
...       ...  ..     ...   ...
27      Annie   F    1326  1881
28     Bertha   F    1324  1881
8      Bertha   F    1320  1880
29      Alice   F    1308  1881
9       Sarah   F    1288  1880

[2780 rows x 4 columns]

In [8]:
df['name'].value_counts()

James      118
William    111
Robert     108
John       108
Mary        92
          ...
Scott        1
Rachel       1
Kelly        1
Crystal      1
Lucas        1
Name: name, Length: 136, dtype: int64